Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_cnano/pic32cm_ls00_map_examples/begin/usart_echo_blocking/firmware/usart_echo_blocking/src/packs/PIC32CM5164LS00048_DFP/component/opamp.h
/* -------- OPAMP_OPAMPCTRL1 : (OPAMP Offset: 0x08) (R/W 32) OPAMP1 Control -------- */
#define OPAMP_OPAMPCTRL1_RESETVALUE           _UINT32_(0x00)                                       /*  (OPAMP_OPAMPCTRL1) OPAMP1 Control  Reset Value */

#define OPAMP_OPAMPCTRL1_ENABLE_Pos           _UINT32_(1)                                          /* (OPAMP_OPAMPCTRL1) Operational Amplifier Enable Position */
#define OPAMP_OPAMPCTRL1_ENABLE_Msk           (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_ENABLE_Pos)       /* (OPAMP_OPAMPCTRL1) Operational Amplifier Enable Mask */
#define OPAMP_OPAMPCTRL1_ENABLE(value)        (OPAMP_OPAMPCTRL1_ENABLE_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_ENABLE_Pos)) /* Assigment of value for ENABLE in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_ANAOUT_Pos           _UINT32_(2)                                          /* (OPAMP_OPAMPCTRL1) Analog Output Position */
#define OPAMP_OPAMPCTRL1_ANAOUT_Msk           (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_ANAOUT_Pos)       /* (OPAMP_OPAMPCTRL1) Analog Output Mask */
#define OPAMP_OPAMPCTRL1_ANAOUT(value)        (OPAMP_OPAMPCTRL1_ANAOUT_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_ANAOUT_Pos)) /* Assigment of value for ANAOUT in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_BIAS_Pos             _UINT32_(3)                                          /* (OPAMP_OPAMPCTRL1) Bias Selection Position */
#define OPAMP_OPAMPCTRL1_BIAS_Msk             (_UINT32_(0x3) << OPAMP_OPAMPCTRL1_BIAS_Pos)         /* (OPAMP_OPAMPCTRL1) Bias Selection Mask */
#define OPAMP_OPAMPCTRL1_BIAS(value)          (OPAMP_OPAMPCTRL1_BIAS_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_BIAS_Pos)) /* Assigment of value for BIAS in the OPAMP_OPAMPCTRL1 register */
#define   OPAMP_OPAMPCTRL1_BIAS_MODE0_Val     _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL1) Minimum current consumption, but the slowest mode  */
#define   OPAMP_OPAMPCTRL1_BIAS_MODE1_Val     _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL1) Low current consumption, slow speed  */
#define   OPAMP_OPAMPCTRL1_BIAS_MODE2_Val     _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL1) High current consumption, fast speed  */
#define   OPAMP_OPAMPCTRL1_BIAS_MODE3_Val     _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL1) Maximum current consumption, but the fastest mode  */
#define OPAMP_OPAMPCTRL1_BIAS_MODE0           (OPAMP_OPAMPCTRL1_BIAS_MODE0_Val << OPAMP_OPAMPCTRL1_BIAS_Pos) /* (OPAMP_OPAMPCTRL1) Minimum current consumption, but the slowest mode Position  */
#define OPAMP_OPAMPCTRL1_BIAS_MODE1           (OPAMP_OPAMPCTRL1_BIAS_MODE1_Val << OPAMP_OPAMPCTRL1_BIAS_Pos) /* (OPAMP_OPAMPCTRL1) Low current consumption, slow speed Position  */
#define OPAMP_OPAMPCTRL1_BIAS_MODE2           (OPAMP_OPAMPCTRL1_BIAS_MODE2_Val << OPAMP_OPAMPCTRL1_BIAS_Pos) /* (OPAMP_OPAMPCTRL1) High current consumption, fast speed Position  */
#define OPAMP_OPAMPCTRL1_BIAS_MODE3           (OPAMP_OPAMPCTRL1_BIAS_MODE3_Val << OPAMP_OPAMPCTRL1_BIAS_Pos) /* (OPAMP_OPAMPCTRL1) Maximum current consumption, but the fastest mode Position  */
#define OPAMP_OPAMPCTRL1_RES2VCC_Pos          _UINT32_(5)                                          /* (OPAMP_OPAMPCTRL1) Resistor ladder To VCC Position */
#define OPAMP_OPAMPCTRL1_RES2VCC_Msk          (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_RES2VCC_Pos)      /* (OPAMP_OPAMPCTRL1) Resistor ladder To VCC Mask */
#define OPAMP_OPAMPCTRL1_RES2VCC(value)       (OPAMP_OPAMPCTRL1_RES2VCC_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_RES2VCC_Pos)) /* Assigment of value for RES2VCC in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Pos         _UINT32_(6)                                          /* (OPAMP_OPAMPCTRL1) Run in Standby Position */
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Msk         (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_RUNSTDBY_Pos)     /* (OPAMP_OPAMPCTRL1) Run in Standby Mask */
#define OPAMP_OPAMPCTRL1_RUNSTDBY(value)      (OPAMP_OPAMPCTRL1_RUNSTDBY_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_ONDEMAND_Pos         _UINT32_(7)                                          /* (OPAMP_OPAMPCTRL1) On Demand Control Position */
#define OPAMP_OPAMPCTRL1_ONDEMAND_Msk         (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_ONDEMAND_Pos)     /* (OPAMP_OPAMPCTRL1) On Demand Control Mask */
#define OPAMP_OPAMPCTRL1_ONDEMAND(value)      (OPAMP_OPAMPCTRL1_ONDEMAND_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_RES2OUT_Pos          _UINT32_(8)                                          /* (OPAMP_OPAMPCTRL1) Resistor ladder To Output Position */
#define OPAMP_OPAMPCTRL1_RES2OUT_Msk          (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_RES2OUT_Pos)      /* (OPAMP_OPAMPCTRL1) Resistor ladder To Output Mask */
#define OPAMP_OPAMPCTRL1_RES2OUT(value)       (OPAMP_OPAMPCTRL1_RES2OUT_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_RES2OUT_Pos)) /* Assigment of value for RES2OUT in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_RES1EN_Pos           _UINT32_(9)                                          /* (OPAMP_OPAMPCTRL1) Resistor 1 Enable Position */
#define OPAMP_OPAMPCTRL1_RES1EN_Msk           (_UINT32_(0x1) << OPAMP_OPAMPCTRL1_RES1EN_Pos)       /* (OPAMP_OPAMPCTRL1) Resistor 1 Enable Mask */
#define OPAMP_OPAMPCTRL1_RES1EN(value)        (OPAMP_OPAMPCTRL1_RES1EN_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_RES1EN_Pos)) /* Assigment of value for RES1EN in the OPAMP_OPAMPCTRL1 register */
#define OPAMP_OPAMPCTRL1_RES1MUX_Pos          _UINT32_(10)                                         /* (OPAMP_OPAMPCTRL1) Resistor 1 Mux Position */
#define OPAMP_OPAMPCTRL1_RES1MUX_Msk          (_UINT32_(0x7) << OPAMP_OPAMPCTRL1_RES1MUX_Pos)      /* (OPAMP_OPAMPCTRL1) Resistor 1 Mux Mask */
#define OPAMP_OPAMPCTRL1_RES1MUX(value)       (OPAMP_OPAMPCTRL1_RES1MUX_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_RES1MUX_Pos)) /* Assigment of value for RES1MUX in the OPAMP_OPAMPCTRL1 register */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OA1POS_Val _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL1) OPAMP1 Positive Input  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OA1NEG_Val _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL1) OPAMP1 Negative Input  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT_Val _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL1) OPAMP0 Output  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_AVSS_Val   _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL1) Ground  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN_Val _UINT32_(0x4)                                        /* (OPAMP_OPAMPCTRL1) RG_CONN  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OA1POS       (OPAMP_OPAMPCTRL1_RES1MUX_OA1POS_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP1 Positive Input Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OA1NEG       (OPAMP_OPAMPCTRL1_RES1MUX_OA1NEG_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP1 Negative Input Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT       (OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP0 Output Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_AVSS         (OPAMP_OPAMPCTRL1_RES1MUX_AVSS_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL1) Ground Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN      (OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /* (OPAMP_OPAMPCTRL1) RG_CONN Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_Pos           _UINT32_(13)                                         /* (OPAMP_OPAMPCTRL1) Potentiometer Selection Position */
#define OPAMP_OPAMPCTRL1_POTMUX_Msk           (_UINT32_(0x7) << OPAMP_OPAMPCTRL1_POTMUX_Pos)       /* (OPAMP_OPAMPCTRL1) Potentiometer Selection Mask */
#define OPAMP_OPAMPCTRL1_POTMUX(value)        (OPAMP_OPAMPCTRL1_POTMUX_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_POTMUX_Pos)) /* Assigment of value for POTMUX in the OPAMP_OPAMPCTRL1 register */
#define   OPAMP_OPAMPCTRL1_POTMUX_14R_2R_Val  _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL1) R1 = 14R, R2 = 2R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_12R_4R_Val  _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL1) R1 = 12R, R2 = 4R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_8R_8R_Val   _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL1) R1 = 8R, R2 = 8R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_6R_10R_Val  _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL1) R1 = 6R, R2 = 10R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_4R_12R_Val  _UINT32_(0x4)                                        /* (OPAMP_OPAMPCTRL1) R1 = 4R, R2 = 12R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_3R_13R_Val  _UINT32_(0x5)                                        /* (OPAMP_OPAMPCTRL1) R1 = 3R, R2 = 13R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_2R_14R_Val  _UINT32_(0x6)                                        /* (OPAMP_OPAMPCTRL1) R1 = 2R, R2 = 14R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_R_15R_Val   _UINT32_(0x7)                                        /* (OPAMP_OPAMPCTRL1) R1 = 1R, R2 = 15R  */
#define OPAMP_OPAMPCTRL1_POTMUX_14R_2R        (OPAMP_OPAMPCTRL1_POTMUX_14R_2R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 14R, R2 = 2R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_12R_4R        (OPAMP_OPAMPCTRL1_POTMUX_12R_4R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 12R, R2 = 4R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_8R_8R         (OPAMP_OPAMPCTRL1_POTMUX_8R_8R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 8R, R2 = 8R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_6R_10R        (OPAMP_OPAMPCTRL1_POTMUX_6R_10R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 6R, R2 = 10R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_4R_12R        (OPAMP_OPAMPCTRL1_POTMUX_4R_12R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 4R, R2 = 12R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_3R_13R        (OPAMP_OPAMPCTRL1_POTMUX_3R_13R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 3R, R2 = 13R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_2R_14R        (OPAMP_OPAMPCTRL1_POTMUX_2R_14R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 2R, R2 = 14R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_R_15R         (OPAMP_OPAMPCTRL1_POTMUX_R_15R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /* (OPAMP_OPAMPCTRL1) R1 = 1R, R2 = 15R Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_Pos           _UINT32_(16)                                         /* (OPAMP_OPAMPCTRL1) Positive Input Mux Selection Position */
#define OPAMP_OPAMPCTRL1_MUXPOS_Msk           (_UINT32_(0xF) << OPAMP_OPAMPCTRL1_MUXPOS_Pos)       /* (OPAMP_OPAMPCTRL1) Positive Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL1_MUXPOS(value)        (OPAMP_OPAMPCTRL1_MUXPOS_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_MUXPOS_Pos)) /* Assigment of value for MUXPOS in the OPAMP_OPAMPCTRL1 register */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA1POS_Val  _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL1) OPAMP1 Positive Input  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP_Val  _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL1) OPAMP1 Resistor ladder taps  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_DAC_REFBUF_Val _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL1) REFERENCE or DAC VOUT0 Output  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_AVSS_Val    _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL1) Ground  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT_Val  _UINT32_(0x4)                                        /* (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA1POS        (OPAMP_OPAMPCTRL1_MUXPOS_OA1POS_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP1 Positive Input Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP        (OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP1 Resistor ladder taps Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_DAC_REFBUF    (OPAMP_OPAMPCTRL1_MUXPOS_DAC_REFBUF_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL1) REFERENCE or DAC VOUT0 Output Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_AVSS          (OPAMP_OPAMPCTRL1_MUXPOS_AVSS_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL1) Ground Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT        (OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_Pos           _UINT32_(20)                                         /* (OPAMP_OPAMPCTRL1) Negative Input Mux Selection Position */
#define OPAMP_OPAMPCTRL1_MUXNEG_Msk           (_UINT32_(0xF) << OPAMP_OPAMPCTRL1_MUXNEG_Pos)       /* (OPAMP_OPAMPCTRL1) Negative Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL1_MUXNEG(value)        (OPAMP_OPAMPCTRL1_MUXNEG_Msk & (_UINT32_(value) << OPAMP_OPAMPCTRL1_MUXNEG_Pos)) /* Assigment of value for MUXNEG in the OPAMP_OPAMPCTRL1 register */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG_Val  _UINT32_(0x0)                                        /* (OPAMP_OPAMPCTRL1) OPAMP0 Negative Input  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP_Val  _UINT32_(0x1)                                        /* (OPAMP_OPAMPCTRL1) OPAMP0 Resistor ladder taps  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_DAC_REFBUF_Val _UINT32_(0x2)                                        /* (OPAMP_OPAMPCTRL1) DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT_Val  _UINT32_(0x3)                                        /* (OPAMP_OPAMPCTRL1) OPAMP0 Output  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG        (OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP0 Negative Input Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP        (OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP0 Resistor ladder taps Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_DAC_REFBUF    (OPAMP_OPAMPCTRL1_MUXNEG_DAC_REFBUF_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL1) DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF) Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT        (OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /* (OPAMP_OPAMPCTRL1) OPAMP0 Output Position  */
#define OPAMP_OPAMPCTRL1_Msk                  _UINT32_(0x00FFFFFE)                                 /* (OPAMP_OPAMPCTRL1) Register Mask  */


/* -------- OPAMP_OPAMPCTRL2 : (OPAMP Offset: 0x0C) (R/W 32) OPAMP2 Control -------- */
#define OPAMP_OPAMPCTRL2_RESETVALUE           _UINT32_(0x00)                                       /*  (OPAMP_OPAMPCTRL2) OPAMP2 Control  Reset Value */

